Revit 2027 API
ParameterTypeId.HostIdParam Property
 "Host Id"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId HostIdParam { get; }
Public Shared ReadOnly Property HostIdParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ HostIdParam {
	ForgeTypeId^ get ();
}
static member HostIdParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace